extends Animal


""" пример поведения Зубра в неволе (требует корректировки)
Время          Барон            
8.00-8.30      кормление  
8.30-9.30      Активный отдых
9.30-10.30     Играет    
10.30-11.00    Отдых  
11.00-11.30    Общение
11.38          Пьет воду
11.39-11.40    Отдых
11.42-11.45    Прогулка
12.00-12.15    Кормился
12.15-13.00    Прогулка
13.00-13.30    Бодался с Барчонком
13.30-14.00    Кормился
14.00-14.30    Резвился
14.30-15.00    Пил воду
15.00-15.30    Активный
15.30-15.40    Пил воду
15.40-17.00    Кормился
17.00-18.30    Отдых
18.30-19.00    Прогулка
19.00-19.30    Прогулка
"""

var action_pattern = {
	"8.00-8.30": ACTIONS.EAT,  
	"8.30-9.30": ACTIONS.RELAX,
	"9.30-10.30": ACTIONS.WALK, 
	"10.30-11.00": ACTIONS.RELAX,
	"11.00-11.30": ACTIONS.WALK,
	"11.38": ACTIONS.DRINK,
	"11.39-11.40": ACTIONS.RELAX,
	"11.42-11.45": ACTIONS.WALK,
	"12.00-12.15": ACTIONS.EAT,
	"12.15-14.30": ACTIONS.WALK,
	"14.30-15.00": ACTIONS.DRINK,
	"15.00-15.30": ACTIONS.WALK,
	"15.30-15.40": ACTIONS.DRINK,
	"15.40-17.00": ACTIONS.EAT,
	"17.00-18.30": ACTIONS.RELAX,
	"18.30-19.30": ACTIONS.WALK,
	"19.30": ACTIONS.SLEEP
}

func _ready():
	print(ground_tilemap)


